<template>
    <div class="demo-root-box" >
        <div class="demo-title-bar">
            <div class="icon-arrow" @click="router.go(-1)"></div>
            自由滚动
        </div>
        <div class="demo-main">
            <it-scroller ref="scroller" pattern="freedom">
                <div class="scroller-content">
               圆饼状的全天候魂导侦察机掠过海面缓缓行进，远处，已经可以见到白皑皑的雪线。

“所长，即将抵达极北之地。”清脆的声音响起，一身白色军装的南澄向坐在副机长位置的蓝潇报告。

他们是一支来自于斗罗联邦科学研究院天斗分院旗下的古魂兽研究所的科考队。自从斗罗联邦大约在九千年前完成了第一次太空之旅后，人类就开始了对太空不停的探索。不断的探索、不断的发现，让人类对宇宙的浩瀚有了越来越多的了解。

伴随着人口的增多以及一些其他问题，人类开始尝试星际移民。经过数千年的不懈努力，终于在一千多年前完成了第一颗行星的移民。之后千余年来，人类已经完成了对七颗行星的移民计划，并且开发。

自从万年前魂兽险些带来覆灭的灾难之后，被誉为斗罗联邦和平之母的那一代议长墨蓝宣布人类与魂兽和平共处。禁止一切对于魂兽的杀戮行为。

联邦在进行第三颗行星殖民的时候，就将这颗星球赠与了魂兽，由当代的数位魂兽之王带领，从小位面万兽台进行了大迁徙。魂兽终于有了属于自己的家园。

之后的第七颗行星，又赠予了魂兽。有了两颗属于自己的星球，魂兽在万年来得到了充分的休养生息，与人类之间的仇怨也彻底化解。人类正在以全新的方式和魂兽进行全面合作，数万年来，从魂兽占领着整个斗罗星人类挣扎求生，到人类发明魂导器，开始压缩魂兽的生存空间，再到万年前苏醒的魂兽之王带领着残存魂兽报复人类。如今，人类与魂兽和平共处。时代的变化，终于让因为魂师职业而密切相关的人类与魂兽，进入了和平发展时期。

蓝潇带领的这支科考队，就是前来极北之地探察，看看还有没有残留在这里的冰雪类魂兽，或者是魂兽遗迹，从而进行对古魂兽的研究。

极北之地曾经被誉为斗罗大陆最后一片净土，这里严酷的环境，才让残存的一些魂兽不被人类伤害。后来也同样进行了迁徙，但这里的魂兽世界自成一体，当时也耗费了很大力气才让绝大多数魂兽认可了移民。但还是有一些选择了留下来或者是隐藏起来。

“好。”蓝潇肩头挂着少校军衔，相貌英俊，他今年三十一岁，毕业于斗罗联邦国立科技学院，主攻魂兽研究。所有的科研单位全部授予军衔，由联邦统一管理。

一边答应着，他的目光不自觉的落在南澄军装下优美的曲线上，他们除了是同事之外，还是一对情侣。美丽的南澄刚进入研究所不久，就被他这位所长近水楼台了。两人感情很好，正计划着这次科考回去就结婚呢。

南澄瞪了他一眼，别过头去。娇俏的样子却引得蓝潇会心一笑。

“进入极北之地后，立刻开启生命探测器。探察强度调高到十年魂兽层次。”蓝潇下令道。

“是。”南澄是专门负责探测的，立刻公事公办的回应道。

极北之地自古以来就是苦寒之地，几乎没有任何植物能在这里生存，以前有魂兽的时候，也以耐寒大型魂兽为主。还有一些类似于冰碧蝎、雪女之类的特殊魂兽存在。

很快，全天候魂导侦察机进入极北之地，向更内圈飞去，柔和的白色光晕围绕在侦察机周围，隔绝着外界苦寒。

扁平的飞机下腹中心位置，一道淡绿色的光芒洒落，光芒落在地面时，形成足以覆盖一平方公里的绿色光圈，在光圈内凡是有生命强度超过十年魂兽层次的，都会被探测出来。这可是最新型的生命探测器。精细度足以深入地下百米。

侦察机延着海岸线一边扫描一边前进。虽然生命探测器探测范围很大，但极北之地十分广袤，想要整体扫一遍，甚至只是探察其中的一部分，也需要一个不短的时间。

【认识十年的老书友给我推荐的追书app，咪咪阅读！真特么好用，开车、睡前都靠这个朗读听书打发时间，这里可以下载 www.mimiread.com 】

“好了，既然到地方了，设定好探测程序，大家都休息一下。希望这次能有所发现。”蓝潇伸展了一下自己的身体，有些懒洋洋的说道。嘴角处始终挂着一抹淡淡的微笑。

看着他的样子，南澄撇了撇嘴，这家伙，总是这样，似乎做什么都漫不经心似的，可却做什么都能做的很好。上学的时候，也没看他怎么努力，就成了学霸。工作之后，很轻松的被研究所录取，明明自己是和他一起录取进来的，现在却还是中尉，而他却已经两次被破格提拔了。要知道，军衔提拔是极难的，在没有战争的情况下，循序渐进想要到校级军官，至少要四十岁以上才有可能。可这家伙今年才三十一岁而已。

想想真是不服气，自己明明比他努力的多啊！甚至，就连追自己的时候，自己似乎也只是懵懵懂懂的，就在他那人畜无害的微笑下投降了。哼！

正想着，身前已是一片阴影遮住灯光，一只大手揉了揉她的头，那熟悉的声音随之在耳边响起，“好啦，探查到什么仪器会自动报警的，陪我吃饭去吧。”

换了别人是在这种重要部门内和同事成了情侣，一定会谨言慎行，可蓝潇却一点这种自觉都没有，就那么公然的和南澄亲近，南澄提醒了他很多次，可他却依然故我，美其名曰：忍不住啊！

“嗯。”南澄站起身，然后才意识到，自己又轻而易举的听了他的话。真该死！

抬头想要瞪他一眼，迎来的却是蓝潇迷人的微笑，眼睛一直，就被他拉住了小手，向飞船的餐厅走去。耳边还传来这家伙的声音，“我就喜欢你傻傻的样子。”

这说谁傻呢？说谁呢！正在她想着要不要发作一下的时候。突然，一连串急促的“滴滴”声吸引了所有人的注意。

南澄几乎是完全下意识的就冲回到自己的位置前，迅速进行了一连串的操作，在她面前的屏幕迅速放大，能够清楚的看到屏幕中，一圈强烈的光晕不断呈扩散状向外释放。

蓝潇紧随其后，也来到她身边，看向那屏幕，脸色也变得凝重起来。

“各单位注意、各单位注意。有可能出现强大生命体，侦察机上升高度到三千米，生命探测器集中探测。防护罩临时开启到最大强度，拦截武器准备。”他毫不犹豫的一连串下令，脸上懒洋洋的样子消失了，取而代之的是凝重。

屏幕上扩散的光晕是红色的，这意味着什么他很清楚，唯有十万年层次级别的魂兽，才有可能释放出如此强大的生命能量。

“利用侦察卫星详细观测。”蓝潇拍了拍南澄的肩膀。

“嗯。”南澄双手如同穿花蝴蝶般在自己面前的操作台上操作着，很快，卫星联通，高清晰侦察卫星在她的引导下锁定目标。

蓝潇站直身体，转向侦察机的主屏幕，主屏幕上，一副画面正在被快速的放大。

刚开始的时候只是白皑皑的一片，很快，就能看清清晰的雪化了。紧接着，是一片被冰雪包围着的山谷。

说是山谷，其实更像是一条裂缝，裂缝在侦察卫星的高清晰探测中迅速放大，一直到山谷深处。一块断裂的岩石旁边。

那庞大的生命能量就是从这里传出来的，当卫星定位在那一点的时候，蓝潇和南澄都清晰的看到，在白雪覆盖之下，隐约有淡淡的金色光晕闪烁。

“再放大一些。”蓝潇沉声道。

画面继续放大一些，这次看的更清楚了，那雪面闪烁着的不只是金色，还有银色。两色缓慢的交替闪烁着。

南澄扭头看向他，轻声道：“那是什么？”

-----------------------------

斗罗4正式开启，今天，也是我们斗罗系列的十周年纪念日，谢谢大家十年以来相濡以沫的支持与喜爱，小唐一定努力写出一个让大家满意的斗罗4.终极斗罗，开始上演。爱你们。也请你们继续爱着你们的斗罗吧。每天两更，这是今天的第一更，晚上还有。

           天斗星作为第一颗被人类发现并且移民成功的行政星，距今已经有数千年的历史了。这颗星球大约有原本斗罗星二分之一大，星球表面有百分之五十四被海洋覆盖，其中百分之四十为淡水海，另外百分之六十才是盐水海。

星球表面本来是没有生物的，是人类到来之后，凭借着科技的力量对于整个星球表面进行开发。

天斗星本身虽然没有生物，但却有着百分之八十类似于斗罗星的环境基础，按照人类科学家们的估算，只要有第一个细胞生物出现，或许只需要几万年就能诞生出一个拥有文明的星球了。而斗罗星的星际殖民到来，无疑将这个速度大大的提升了。

之所以用天斗来命名，是为了纪念那个曾经斗罗大陆上最强大的国家。

自从万年前那场魂兽造成的灾难发生之后，整个斗罗星因祸得福开始进化，人类也随之摒弃前嫌。当时原本三分天下的斗罗联邦、天斗帝国、星罗帝国在经过近百年的磋商和谈判之后决定合并，依旧称之为斗罗联邦。原本的天斗帝国和星罗帝国变成两个自治地区。史称天斗自治区和星罗自治区。内部完全自治，但资源却和联邦共享。从而加速科学探索研究。

斗罗大陆所在的斗罗星现在也被称之为母星，天斗星作为第一颗被殖民的行政星，开发无疑也是最为完善的，除了整体能量层次不能和母星相比，这里的一切也与母星并没有太大差别。尤其是天斗星矿产极为丰富，富含各种稀有金属，正是因为有了它，才让人类有更多的力量继续进行星际移民。要知道，每一次星际移民所消耗的资源都是绝对的天文数字。

天斗星，联邦科学研究院天斗星分院的总部内，正进行着一场划时代的科研实验。

【认识十年的老书友给我推荐的追书app，咪咪阅读！真特么好用，开车、睡前都靠这个朗读听书打发时间，这里可以下载 www.mimiread.com 】

巨大的穹顶实验室内，数百名顶尖科学家正在分别忙碌着。而在实验室中央，一个巨大的培养皿内，一个人形浸泡在液体之中。

“准备开始升温、融化。加入高浓度生物养分。准备魂导能量注入。”站在主位，一位白发苍苍的老科学家声音低沉的下达着命令。

培养皿内，因为液体的浑浊，看不清里面的到底是一个怎样的存在，但所有科学家此时都有些紧张。

这是一个解冻复生试验。标本是早在三百年前发现于母星极北之地的。尸体保存极为完整，没有任何伤口存在。因为当时的技术还不完善，没有尝试解冻。

最近数千年来，伴随着人类开发更多行星、发现更多物质，科学水平突飞猛进。已经成功进行了多次解冻复生试验。一些被冻住数年的生物解冻复生也能成功。

而眼前这具尸体，保守估计已经存在了上千年的时间。解冻冰封如此之久的尸体在人类历史上还是第一次，有着划时代的意义。而且根据科学家们的推断，这冰封之中的人可能存在的年代已经十分久远，如果真的复生成功，她带来的就不只是科学意义，还有历史意义。

为了今天的解冻复生试验，科学家们已经做好了充分准备，想了无数种预案。

“开始融化了。按照冰融的速度，实验体存在的时间很可能更长。”

冰冻时间越长的坚冰，融化时的时间也会越长。

科学家们都有些激动起来，无疑，这具尸体存在的时间越长，如果她能复生活过来，意义也就越大。

“融化结束，本体露出。是否开始注射大脑修复液和器官修复液？”

“开始注射。”

“是，重复，开始注射。”

科学家们紧张的忙碌着。

但就在下一瞬，刺耳的警报声就响了起来。“紧急报告，无法注射。合金针头无法刺入实验体，已经断折。”

“什么？”为首的老科学家大吃一惊，合金针头是什么样的强度他再清楚不过。就算是坚硬如机甲，也能轻易刺破啊！

“是不是融化不彻底？肌体本身未曾融化？”

“肌体融化顺利，身体已经是柔软的，但皮肤却坚韧异常，就是无法刺入。首席，现在该怎么办？”

“立刻注入魂导能量，进行强刺激复苏。”首席科学家当机立断的下达命令。但脸色已是一片颓然。不只是他，身边的众位科学家也都是如此。

他们都很清楚，实验体复生的可能性已经很小了。按照以往的经验，解冻后的实验体必须第一时间进行大脑修复和器官修复，才有可能活过来。超低温冷冻保存最好的是血液，伤害最大的是大脑。第一时间未能修复大脑的话，复生可能性连百分之一都没有。除非是冰冻了只有几个小时。更何况，这个实验体已经被冰冻了几千年。给她准备的修复液都是加强型的，现在无法注入身体内部，只是在外部浸泡，效果肯定是差得多了。

伴随着培养皿内魂导能量注入，开始散发出淡淡的白色光晕。

首席科学家叹息一声，“我们还是大意了，没有考虑到这种情况。这个实验体很可能很不一般，甚至有可能是魂兽修炼成人，所以身体强度才会如此之高。现在换针已经来不及了。早知道就应该向总部申请最高强度的输液针。这个责任，我来承担。”

“首席，您别这么说，大家都没考虑到这个问题，有什么责任咱们也该一起承担啊！”在他身边一名中年人赶忙说道。

“等一下，你们看。”突然，另一边一名老年女性科学家突然指向培养皿。

众位科学家的目光随之看去，他们惊讶的发现，原本培养皿内浑浊的液体突然变得通透起来，里面的人形也开始变得越发清晰。

“这是……”

当那人形渐渐露出本来模样的时候，所有人都不禁看的有些呆住了。

那是一名少女，一名绝美的少女。先前因为封在厚厚的冰层之中，并不能看到她全部样貌。

她的身体被一层银色长裙所覆盖，头发也是银色的，身材修长。虽然双眸紧闭，可那长长的睫毛还是有种动人心魄的感觉。在场所有男性科研人员的目光都不由自主的被她吸引了过去，一时间，不由得目瞪口呆。

“快，加大魂导能量注入。她好像在自行吸收培养皿内的营养液，重新更换营养液，快！”首席科学家几乎是疯狂的叫出声，也同时唤醒了呆滞中的科学家们。

实验室内又重新变得忙碌起来，科学家们飞快的行动起来。

培养皿内被重新注入营养液，魂导能量更是持续注入。但是，诡异的情况出现了，无论那营养液如何注入，培养皿内的液体却始终都是清澈的。那少女的身体仿佛星辰大海一般，吞噬着所有的营养成分和被注入的魂导能量。

这个过程，整整过了一个小时。

“你们看，她、她刚刚好像皱了下眉？”一名眼尖的青年科学家突然指着培养皿说道。

根本不需要去证明他的话，因为下一瞬，通过传音器材，轻微的心跳声响了起来，“咚咚、咚咚、咚咚。”

对于科学家们来说，这简直就是天籁之音啊！更让他们惊喜的是，培养皿内的少女的睫毛动了动，缓缓睁开了她的眼眸。

她的眼眸是淡紫色的，眼眸黯淡无光，显露着极度的疲惫，她茫然的看着面前的培养皿，抬了抬手，似乎是想要移动。

“停止营养液注入。释放营养液，氧气注入。”首席科学家快速下达命令。刚刚从冰冻中苏醒过来的人，最怕的就是窒息。那很可能会导致二次的脑死亡。

液体倾泻，氧气注入。那少女的眼神似乎变得更加黯淡了。她目光呆滞的喃喃道：“我好累，我是谁？我在哪？”
</div>
            </it-scroller>
        </div>
    </div>
</template>
<script lang="ts" setup>
import { ref, onMounted, getCurrentInstance } from 'vue'
import { useRouter } from 'vue-router'
import ItScroller from '../src/index.vue'
import '../style/index.scss'
interface Item {
    title: string
}
const router = useRouter()
</script>
<style lang="scss" scoped>
.demo-main {
    display: flex;
    .scroller-content {
        width: 2000px;
        font-size: 16px;
        line-height: 40px;
    }
   .left {
       width: 80px;
       box-shadow: 2px 0px 10px rgba(0,0,0, 0.1) ;
    //    background-color: rgba(0,0,0, 0.1)
   }
   .item-btn {
       height: 50px;
       display: flex;
       align-items: center;
       justify-content: center;
       &.active {
           background-color: rgba(0,0,0, 0.1)
       }
   }
}
.item-demo {
    height: 50px;
    line-height: 50px;
    padding-left: 16px;
    border-bottom: #ddd solid 1px;
    width: 1000px;
}
.header-domo{
    height: 30px;
    background-color: #eee;
    line-height: 30px;
    padding-left: 10px;
}
.demo-scroller-fixed{
    width: 80px;
    height: 80px;
    background-color: #fff;
    box-shadow: 0px 0px 10px rgba(0,0,0, 0.1);
    border-radius: 50%;
    display: flex;
    align-items: center;
    justify-content: center;
    line-height: 0;
    position:absolute;
}
</style>
